tests/cassettes/test_invoices/test_issue_invoice.yaml

interactions:
- request:
    body: '{"correlationId": "2b1feb1c-4ed2-485c-9ef3-a2434c5463a9", "description":
      "Invoice for order 123", "amount": {"currency": "USD", "amount": "1.00"}}'
    headers:
      Accept:
      - application/json
      Accept-Encoding:
      - gzip, deflate
      Connection:
      - keep-alive
      Content-Length:
      - '146'
      Content-Type:
      - application/json
      User-Agent:
      - python-requests/2.28.1
    method: POST
    uri: https://api.strike.me/v1/invoices
  response:
    body:
      string: '{"invoiceId":"5439b0c5-31cf-4f35-85b6-f18da629f8ec","amount":{"currency":"USD","amount":"1.00"},"state":"UNPAID","created":"2022-11-05T14:40:46.0431903+00:00","correlationId":"2b1feb1c-4ed2-485c-9ef3-a2434c5463a9","description":"Invoice
        for order 123","issuerId":"df7666c0-36bf-4ead-bed9-faef9188f96b","receiverId":"df7666c0-36bf-4ead-bed9-faef9188f96b"}'
    headers:
      CF-Cache-Status:
      - DYNAMIC
      CF-RAY:
      - 765658af38e02c0b-ORD
      Connection:
      - keep-alive
      Content-Length:
      - '354'
      Content-Type:
      - application/json; charset=utf-8
      Date:
      - Sat, 05 Nov 2022 14:40:46 GMT
      Location:
      - https://api.strike.me/v1/invoices/5439b0c5-31cf-4f35-85b6-f18da629f8ec
      Server:
      - cloudflare
      Set-Cookie:
      - __cf_bm=bxv9U5_b9vntoSD8QdzaZrnHG_3hQ93nSgqXOl7tnnQ-1667659246-0-Ad4lBIBoQji1L8RwP6xeyG3c3R9tRKeg4Yo3gP0s+kpn+BzIpZe8yYQAB3XzFsqTgf1WnO13VH8tR+/2rnMlTIk=;
        path=/; expires=Sat, 05-Nov-22 15:10:46 GMT; domain=.strike.me; HttpOnly;
        Secure; SameSite=None
      Strict-Transport-Security:
      - max-age=300; includeSubDomains
      Via:
      - 1.1 google
      X-Content-Type-Options:
      - nosniff
    status:
      code: 201
      message: Created
version: 1
