tests/cassettes/test_invoices/test_issue_invoice_for_handle.yaml

interactions:
- request:
    body: '{"correlationId": "f24b02e2-458b-47a4-855d-9e6d9aabf477", "description":
      "Invoice for order 123", "amount": {"currency": "USD", "amount": "1.00"}}'
    headers:
      Accept:
      - application/json
      Accept-Encoding:
      - gzip, deflate
      Connection:
      - keep-alive
      Content-Length:
      - '146'
      Content-Type:
      - application/json
      User-Agent:
      - python-requests/2.28.1
    method: POST
    uri: https://api.strike.me/v1/invoices/handle/chmoder
  response:
    body:
      string: '{"invoiceId":"9d39c900-9da4-4460-9f0c-bab2ac9a6c77","amount":{"currency":"USD","amount":"1.00"},"state":"UNPAID","created":"2022-11-05T14:40:46.4011766+00:00","correlationId":"f24b02e2-458b-47a4-855d-9e6d9aabf477","description":"Invoice
        for order 123","issuerId":"df7666c0-36bf-4ead-bed9-faef9188f96b","receiverId":"df7666c0-36bf-4ead-bed9-faef9188f96b"}'
    headers:
      CF-Cache-Status:
      - DYNAMIC
      CF-RAY:
      - 765658b179ac2958-ORD
      Connection:
      - keep-alive
      Content-Length:
      - '354'
      Content-Type:
      - application/json; charset=utf-8
      Date:
      - Sat, 05 Nov 2022 14:40:46 GMT
      Location:
      - https://api.strike.me/v1/invoices/9d39c900-9da4-4460-9f0c-bab2ac9a6c77
      Server:
      - cloudflare
      Set-Cookie:
      - __cf_bm=JcrAwETTDIaqKa.X6hGOERHMAfn2shoS3W62NEph17I-1667659246-0-ARUarhRkE+znxuCSiQcLxd9kCybB6O3MdqU2+XsUp4/kKB5vwBpzhY/hRpNQSQhqBwLIFvfUyw9Cv7iJIP407gw=;
        path=/; expires=Sat, 05-Nov-22 15:10:46 GMT; domain=.strike.me; HttpOnly;
        Secure; SameSite=None
      Strict-Transport-Security:
      - max-age=300; includeSubDomains
      Via:
      - 1.1 google
      X-Content-Type-Options:
      - nosniff
    status:
      code: 201
      message: Created
version: 1
