tests/cassettes/test_invoices/test_issue_quote.yaml

interactions:
- request:
    body: null
    headers:
      Accept:
      - application/json
      Accept-Encoding:
      - gzip, deflate
      Connection:
      - keep-alive
      Content-Length:
      - '0'
      User-Agent:
      - python-requests/2.28.1
    method: POST
    uri: https://api.strike.me/v1/invoices/5f8a40b4-910f-439d-9a61-81fae87f0a8e/quote
  response:
    body:
      string: '{"quoteId":"643dbf45-3fe6-44bf-a8da-3f6041c3aabe","description":"Invoice
        for order 123","lnInvoice":"lnbc516360n1p3kvlwupp552sfuypas9q406ratpg6myzjdq25d6ceqspxlf6hfgad32aljc0sdpzf9h8vmmfvdjjqen0wgsx7unyv4ezqvfjxvcqzpgxqzr4fppqh9p7w65cc56jt8nyks9tzgvcqxgpgndhsp5lvddzf2tn2gymvugc96jc5mk4vfh7feprwml5k8zp2zn9urc9fgq9qyyssqvvnl2jrsyezmuze244s4qcd0vtp3sar08fufyxj8za7j2qjqa85h3ktx9258e6ujks0ps0zh46kgvaml9pamyp36xa00hx2amly87jgqk4m6d5","onchainAddress":"bc1qh9p7w65cc56jt8nyks9tzgvcqxgpgndhjtqcfc","expiration":"2022-11-05T15:16:34.206+00:00","expirationInSec":117,"targetAmount":{"currency":"USD","amount":"10.99"},"sourceAmount":{"currency":"BTC","amount":"0.00051636"},"conversionRate":{"amount":"21283.6006","sourceCurrency":"BTC","targetCurrency":"USD"}}'
    headers:
      CF-Cache-Status:
      - DYNAMIC
      CF-RAY:
      - 76568a3eeb992d8e-ORD
      Connection:
      - keep-alive
      Content-Length:
      - '755'
      Content-Type:
      - application/json; charset=utf-8
      Date:
      - Sat, 05 Nov 2022 15:14:36 GMT
      Location:
      - https://api.strike.me/v1/quotes/643dbf45-3fe6-44bf-a8da-3f6041c3aabe
      Server:
      - cloudflare
      Set-Cookie:
      - __cf_bm=1tawevolb.FaLq6JuDncmBz_PTFvrkBqmFRDp7JdG24-1667661276-0-AVaJxWuZKJcUctos1JWew2CwanA+l5kgh4nnuge6Qunc5bO3fOUobgY5rPXGzk98kyYncSgLl64TfCwh7aQF7Dg=;
        path=/; expires=Sat, 05-Nov-22 15:44:36 GMT; domain=.strike.me; HttpOnly;
        Secure; SameSite=None
      Strict-Transport-Security:
      - max-age=300; includeSubDomains
      Via:
      - 1.1 google
      X-Content-Type-Options:
      - nosniff
    status:
      code: 201
      message: Created
version: 1
